Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet.StraightDimensionSetAttributes.IncludePartCountInTag Property
 Gets or sets whether the part count is included in at least one of the tag position, or set part count flag for all tag positions.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IncludePartCountInTag { get; set; }
Public Property IncludePartCountInTag As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
StraightDimensionSet.StraightDimensionSetAttributes Class
Tekla.Structures.Drawing Namespace